src/AccumulationRegisters/ЗаказыПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПоставщикам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ТипПоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипПоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Кросс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VMI</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ИдентификаторыСтрокЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ИдентификаторыСтрокЗаявок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследняяКорректировка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗаявкиПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDSite</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрайсПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрайсыПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГарантированный</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОжидаемый</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГарантированныйЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОжидаемыйЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗакупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСостояниеЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виртуальная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзготовительПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АртикулПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипПоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ЗаявкиПокупателяКлиентСервер/Ext/Module.bsl
#Область РаботаСоСтрокамиЗаявок
Функция СтрокаЗаявкиЗакрыта(СтрокаЗаявки,Отказ = ложь) Экспорт
	
	ЗаявкаЗакрыта = СтрокаЗаявки.СостояниеЗаявки = Справочники.СтатусыДокументов.ЗаявкаПокупателяЗакрыт;
	Отказ = ЗаявкаЗакрыта;
	 Возврат  ЗаявкаЗакрыта;
	
КонецФункции	

Функция ЗаказЗакрыт(ДокументСсылка) Экспорт
ЗапросЗакрытых  = новый Запрос("ВЫБРАТЬ
                               |	ЗаказПоставщикуТовары.СтрокаЗаявки
                               |ПОМЕСТИТЬ ВТСтрокиДокумента
                               |ИЗ
                               |	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
                               |ГДЕ
                               |	ЗаказПоставщикуТовары.Ссылка = &ДокументСсылка
                               |
                               |ОБЪЕДИНИТЬ ВСЕ
                               |
                               |ВЫБРАТЬ
                               |	КорректировкаЗаказаПоставщикуТовары.СтрокаЗаявки
                               |ИЗ
                               |	Документ.КорректировкаЗаказаПоставщику.Товары КАК КорректировкаЗаказаПоставщикуТовары
                               |ГДЕ
                               |	КорректировкаЗаказаПоставщикуТовары.Ссылка = &ДокументСсылка
                               |;
                               |
                               |////////////////////////////////////////////////////////////////////////////////
                               |ВЫБРАТЬ РАЗЛИЧНЫЕ
                               |	МАКСИМУМ(ЗаказыПоставщикамОстатки.СтрокаЗаявки) КАК СтрокаЗаявки
                               |ИЗ
                               |	ВТСтрокиДокумента КАК ВТСтрокиДокумента
                               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПоставщикам.Остатки КАК ЗаказыПоставщикамОстатки
                               |		ПО ВТСтрокиДокумента.СтрокаЗаявки = ЗаказыПоставщикамОстатки.СтрокаЗаявки
                               |			И (ЗаказыПоставщикамОстатки.КоличествоОстаток > 0)
                               |
                               |ИМЕЮЩИЕ
                               |	МАКСИМУМ(ЗаказыПоставщикамОстатки.СтрокаЗаявки) ЕСТЬ NULL")	;
ЗапросЗакрытых.УстановитьПараметр("ДокументСсылка",ДокументСсылка);
Результат  = ЗапросЗакрытых.Выполнить();

Возврат не Результат.Пустой();
Конецфункции	

Процедура ПроверитьНаЗакрытыеСтроки(ТЧТоваров,Отказ = ложь,ТипПоставкиПроверки = Неопределено) Экспорт
	ЗапросЗакрытых = новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ 
	|	ИдентификаторыСтрокЗаявок.Ссылка как СтрокаЗаявки
	|ИЗ
	|	Справочник.ИдентификаторыСтрокЗаявок КАК ИдентификаторыСтрокЗаявок
	|ГДЕ
	|	ИдентификаторыСтрокЗаявок.СостояниеЗаявки = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ЗаявкаПокупателяЗакрыт)
	|	И ИдентификаторыСтрокЗаявок.Ссылка В(&МассивСтрокЗаявок)
	| %1 ";
	ЗапросЗакрытых.Текст = СтрШаблон(ТекстЗапроса,?(ТипПоставкиПроверки = Неопределено,"","И ИдентификаторыСтрокЗаявок.ТипПоставки = &ТипПоставки "));
	ЗапросЗакрытых.УстановитьПараметр("МассивСтрокЗаявок",ТЧТоваров.выгрузитьКолонку("СтрокаЗаявки"));
	ЗапросЗакрытых.УстановитьПараметр("ТипПоставки",ТипПоставкиПроверки);	
	
	Результат = ЗапросЗакрытых.Выполнить();
	
	Если не Результат.Пустой() тогда 
		МассивЗакрытыхСтрок = результат.Выгрузить().ВыгрузитьКолонку("СтрокаЗаявки");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В документе присутствуют закрытые строки ( "+СтрСоединить(МассивЗакрытыхСтрок)+" ), распроведение запрещено",,,,отказ);
	КонецЕсли;	
	
	
КонецПроцедуры	
	
Функция  ПолучитьНаименованиеЗаявки(Артикул,НомерЗаявки,ТипПоставки,Разделитель = ";") Экспорт
Возврат НомерЗаявки +Разделитель+ СокрЛП(Артикул) + Разделитель+СокрЛП(ТипПоставки);		
КонецФункции	

#КонецОбласти

#Область РаботаСрозниянымиЗаявками

Процедура СоздатьОбновитьСТрокуЗаявкиРозничнойЗаявки(ДокументОбъект) Экспорт
ВыборкаСтрокЗаявок = ПолучитьВыборкуСтрокЗаявокКОбновлению(ДокументОбъект);
Пока ВыборкаСтрокЗаявок.Следующий() цикл 
	если ВыборкаСтрокЗаявок.КСозданию тогда 
		  СтрокаЗаявки = Справочники.ИдентификаторыСтрокЗаявок.СоздатьЭлемент();
		  СтрокаЗаявки.Заявка = ПолучитьСсылкуДокументЗаявки(ДокументОбъект);
		  СтрокаЗаявки.Наименование = ПолучитьНаименованиеЗаявки(ВыборкаСтрокЗаявок.Артикул,ДокументОбъект.НомерРозничнойЗаявки,ВыборкаСтрокЗаявок.ТипПоставки);			  
	ИначеЕсли ВыборкаСтрокЗаявок.КОбновлению тогда 
		  СтрокаЗаявки = ВыборкаСтрокЗаявок.СтрокаЗаявки ;
	иначе 
		Продолжить;
	КонецЕсли;	
	
	ЗаполнитьЗначенияСвойств(СтрокаЗаявки,ВыборкаСтрокЗаявок);
	СтрокаЗаявки.Записать();
	
	Если ВыборкаСтрокЗаявок.КСозданию тогда 
		 НайдСтроки = ДокументОбъект.Товары.НайтиСтроки(новый Структура("IDSite",ВыборкаСтрокЗаявок.IDSite));
		 Для каждого НайдСтрока из НайдСтроки цикл 
			 НайдСтрока.СтрокаЗаявки = СтрокаЗаявки.ссылка;
		КонецЦикла;	 
	Конецесли 	
	
КонецЦикла;	
	
КонецПроцедуры	



Функция ПолучитьСсылкуДокументЗаявки(ДокументОбъект)
	
	Если ДокументОбъект.ЭтоНовый() Тогда 
			СсылкаНаДокумент = ДокументОбъект.ПолучитьСсылкуНового();
			
			Если СсылкаНаДокумент.Пустая() Тогда 
				СсылкаНаДокумент = Документы.ЗаявкаПокупателя.ПолучитьСсылку();
				ДокументОбъект.УстановитьСсылкуНового(СсылкаНаДокумент);
			КонецЕсли;
			
		Иначе
			СсылкаНаДокумент = ДокументОбъект.Ссылка;
		КонецЕсли;

	  Возврат СсылкаНаДокумент
	
КонецФункции	

Функция ПолучитьВыборкуСтрокЗаявокКОбновлению(ДокументОбъект)
ЗапросСтрок = новый запрос;
ЗапросСтрок.Текст = "ВЫБРАТЬ
                    |	ВЫРАЗИТЬ(ЗаявкаПокупателяТовары.СтрокаЗаявки КАК Справочник.ИдентификаторыСтрокЗаявок) КАК СтрокаЗаявки,
                    |	ЗаявкаПокупателяТовары.IDSite,
                    |	ЗаявкаПокупателяТовары.ЦенаЗакупки,
                    |	ЗаявкаПокупателяТовары.Цена,
                    |	ЗаявкаПокупателяТовары.ПрайсПоставщика,
                    |	ИСТИНА КАК РозничнаяЗаявка,
                    |	ЛОЖЬ КАК Виртуальная,
                    |	&СостояниеЗаявки,
                    |	&ТипПоставки,
                    |	ЗаявкаПокупателяТовары.Количество,
                    |	ВЫРАЗИТЬ(ЗаявкаПокупателяТовары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
                    |ПОМЕСТИТЬ ДанныеДокумента
                    |ИЗ
                    |	&Товары КАК ЗаявкаПокупателяТовары
                    |;
                    |
                    |////////////////////////////////////////////////////////////////////////////////
                    |ВЫБРАТЬ
                    |	ДанныеДокумента.СтрокаЗаявки,
                    |	ДанныеДокумента.IDSite,
                    |	ДанныеДокумента.ЦенаЗакупки,
                    |	ДанныеДокумента.Цена,
                    |	ДанныеДокумента.ПрайсПоставщика,
                    |	ДанныеДокумента.РозничнаяЗаявка,
                    |	ДанныеДокумента.Виртуальная,
                    |	ДанныеДокумента.СостояниеЗаявки,
                    |	ВЫБОР
                    |		КОГДА ДанныеДокумента.СтрокаЗаявки = ЗНАЧЕНИЕ(Справочник.ИдентификаторыСтрокЗаявок.Пустаяссылка)
                    |			ТОГДА ИСТИНА
                    |		ИНАЧЕ ЛОЖЬ
                    |	КОНЕЦ КАК КСозданию,
                    |	ДанныеДокумента.ТипПоставки,
                    |	ДанныеДокумента.Количество,
                    |	ВЫБОР
                    |		КОГДА ДанныеДокумента.ТипПоставки = ЗНАЧЕНИЕ(Перечисление.ТипПоставки.VMI)
                    |			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(ДанныеДокумента.ПрайсПоставщика КАК Справочник.ПрайсыПоставщиков).Владелец КАК Справочник.ТорговыеТочки).Владелец
                    |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.Пустаяссылка)
                    |	КОНЕЦ КАК Поставщик,
                    |	ДанныеДокумента.Номенклатура.Артикул КАК Артикул
                    |ИЗ
                    |	ДанныеДокумента КАК ДанныеДокумента"	;
ЗапросСтрок.УстановитьПараметр("Товары",ДокументОбъект.Товары.Выгрузить());
ЗапросСтрок.УстановитьПараметр("ТипПоставки",ТипПоставкиПоСкладу(ДокументОбъект.склад));
ЗапросСтрок.УстановитьПараметр("СостояниеЗаявки",ДокументОбъект.СтатусДокумента);

Результат = ЗапросСтрок.Выполнить();
Возврат Результат.Выбрать();

	
КонецФункции


Функция ТипПоставкиПоСкладу(Склад)
	если Склад.СкладVMI тогда 
		ВОзврат ПредопределенноеЗначение("Перечисление.ТипПоставки.VMI");
	иначе 
		Возврат ПредопределенноеЗначение("Перечисление.ТипПоставки.Сток");
	КонецЕсли;	
	
КонецФункции	
#КонецОбласти
